shellproject/weblogic12c/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/oxp/service/v2">
   <soapenv:Header/>
   <soapenv:Body>
      <v2:getReportDefinition>
         <v2:reportAbsolutePath>/Chetan/simple/template.xdo</v2:reportAbsolutePath>
         <v2:userID>weblogic</v2:userID>
         <v2:password>signum64</v2:password>
      </v2:getReportDefinition>
   </soapenv:Body>
</soapenv:Envelope>